tests/integration/test_flamelet_particle_heating/foam_template/constant/particlePositions

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       vectorField;
    object      coalCloud1Positions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

(
(0.5e-3 0.5e-3 0.5e-3)
(0.625e-3 0.625e-3 0.625e-3)
(0.75e-3 0.75e-3 0.75e-3)
)


// ************************************************************************* //
