tests/integration/test_flamelet_particle_heating/foam_template/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mechanismFile "constant/ch4_smooke_EKT.yaml";
phaseName "gas";
energyType ha; 
transportModel UnityLewis;
useSoret false;
inertSpecies N2;

liquids
{
    //H2O;
}

solids
{
//    ash;
    C;
}


// ************************************************************************* //
