tests/integration/test_flamelet_particle_heating/foam_template/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// blockMesh :  Block mesh description file
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
version  0.5;
format   ascii;
root     "";
case     "";
instance "constant";
local    "mesh";
class dictionary;
object blockMeshDict;
}
// ************************************






   meshGenApp blockMesh;
   //convertToMeters 0.001;
   scale 	     0.001;

    	// width
   	// length         

   	// cells along width
    	// cells along length
   
   
   
   
   vertices
   ( 
    (1 0 0) // Vertex fiveoclockfn = 0   //Inner mesh block
    (0 0 0) // Vertex sevenoclockfn = 1 
    (0 1 0) // Vertex elevenoclockfn = 2 
    (1 1 0) // Vertex oneoclockfn = 3 
    (1 0 1) // Vertex fiveoclockfp1 = 4   //main jet
    (0 0 1) // Vertex sevenoclockfp1 = 5 
    (0 1 1) // Vertex elevenoclockfp1 = 6 
    (1 1 1) // Vertex oneoclockfp1 = 7 
      );				

   blocks
   (
    // Quadratischer Kern
    // Kern
    hex (
	 1 0 3 2
      	 5 4 7 6 
	)
    (2 2 2)
    simpleGrading (1 1 1)
  );
boundary
(

    WALL
    {
        type patch;
        faces
        (
     (0 3 7 4)
     (1 0 4 5)
     (2 1 5 6)
     (3 2 6 7)



        );
    }
    
    OUTLET 
    {
	type patch;
	faces
	(
        (5 4 7 6)
 
	);
    }

    INLET
    {
	type patch;
    faces
	(

        (1 0 3 2)
	);
    } 

   
);



