tests/integration/test_flamelet_particle_heating/foam_template/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application    flameletCloudFoam;

startFrom      startTime;//latestTime;//

startTime       0.0;

stopAt          endTime;//writeNow;//

endTime         0.07;

deltaT          1e-6;

writeControl    adjustableRunTime;

writeInterval   0.002;

purgeWrite      1;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.8;

maxDeltaT       5e-5;

deleteParticles false;


clouds
{
        carbCloud      carbonaceousCloud;

}

libs    (	"libreactionThermophysicalModelsSTFS.so"
			"libgroovyBC.so" );

// ************************************************************************* //
functions
{
    writeCarbCloud
    {
        type            vtkCloud;
        libs            (lagrangianFunctionObjects);
        writeControl    adjustableRunTime;
        writeInterval   1e-3;
        format          ascii;
        cloud           carbCloud;
        fields          ( T origId );
    }
    probes
    {
        libs ( "libsampling.so" );
        type            probes;
        name            probes;
        fields          ( T );
        writeControl    adjustableRunTime;
        writeInterval   1e-3;
	interpolationScheme cellPoint;
	probeLocations  
	( 	( 0.5e-3   0.5e-3   0.5e-3   ) 
		( 0.625e-3 0.625e-3 0.625e-3 ) 
		( 0.75e-3  0.75e-3  0.75e-3  )  
	);
    }
}
